Catalogs/бит_ВариантыСчетовИзвещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ВариантыСчетовИзвещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКМакету</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПечатнойФормы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПользовательскуюФункцию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФункции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВариантыСчетовИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_ТекущиеНастройкиМакетовСчетИзвещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ТекущиеНастройкиМакетовСчетИзвещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаМакета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиПечатиМакетовСчетИзвещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МакетКвитанции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВариантыСчетовИзвещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ВариантыСчетовИзвещений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
Процедура ВыборДоступногоПоля(ВыбраннаяСтрока)
	
	Если ВыбраннаяСтрока.Поле = "Реквизиты"
		ИЛИ ВыбраннаяСтрока.Поле = "Строка: Таблица начислений" 
		ИЛИ ВыбраннаяСтрока.Поле = "Строка: Таблица счетчиков" 
		ИЛИ ВыбраннаяСтрока.Поле = "Строка: Таблица перерасчетов" Тогда
		Возврат;
	КонецЕсли; 
	
	// Перед началом добавления необходимо выделить область в табличном документе.
	Если НЕ ТипЗнч(ПолеТабличногоДокумента.ТекущаяОбласть) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ВыборДоступногоПоляЗавершение", ЭтотОбъект), НСтр("ru = 'Для переноса поля шаблона нужно выделить ячейку или область ячеек!'"));
		Возврат;
	Иначе
		ТекущаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
		ОбъединитьОбласть(ТекущаяОбласть.Имя);
	КонецЕсли;
	
	ИмяПоля = Строка(ВыбраннаяСтрока.Поле);
	
	ТекущаяОбласть.Заполнение       = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
	ТекущаяОбласть.Параметр         = ИмяПоля;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДоступногоПоляЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Предопределенные элементы не редактируются.");
		Возврат;
		
	КонецЕсли; 
	
	ОбновитьДеревоПолей();
	
	ПолеТабличногоДокумента = Новый ТабличныйДокумент;
	ПолеТабличногоДокумента.Защита = Ложь;
	Элементы.Результат.Защита      = Ложь;
	// СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_ВариантыСчетовИзвещений"));.
	ПолеТабличногоДокумента = Объект.Ссылка.ШаблонПечатнойФормы.Получить(); 
	
	УправлениеВидимостьюЭлементовФормы();
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.КодФункции = "Результат = Новый ТабличныйДокумент;";
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ШаблонПечатнойФормы = Новый ХранилищеЗначения(ПолеТабличногоДокумента);
	ТекущийОбъект.ДатаИзменения = ТекущаяДата();
	
	// БИТ_ЖКХ 07.02.2014
	// ТекущийОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");.
	ТекущийОбъект.Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	// БИТ_ЖКХ 07.02.2014
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// БИТ_ЖКХ 15.08.2016 17:36:11 Начало правки... неконтролируемы рост новых элментов справочника
	//СоздатьНастройкиМакета(ТекущийОбъект);
	//Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
	//	СоздатьНастройкиМакета(ТекущийОбъект);
	//КонецЕсли;
	// БИТ_ЖКХ 15.08.2016 17:36:31 Конец правки. 
	
	// БИТ_ЖКХ 06.12.2016 16:03:19 Начало правки...  
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СоздатьНастройкиМакета(ТекущийОбъект);
	КонецЕсли;
	// БИТ_ЖКХ 06.12.2016 16:03:21 Конец правки.
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Параметры.Ключ.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Созданы стандартные настройки макета.");
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ОчиститьМакет(Команда)
	ПолеТабличногоДокумента.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОсновнойМакет(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Предопределенный", Истина);
	
	ОткрытьФорму("Справочник.бит_ВариантыСчетовИзвещений.Форма.ФормаВыбора", Новый Структура("Отбор", Отбор), Элементы.ОсновнойВариант,,,, Новый ОписаниеОповещения("ЗагрузитьОсновнойМакетЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОсновнойМакетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// БИТ_ЖКХ 06.12.2016 15:59:51 Начало правки... 
	//ПутьКМакету = ПутьКМакетуНаСервере(Объект.ОсновнойВариант);
	ПутьКМакету = ПутьКМакетуНаСервере(Результат);
	// БИТ_ЖКХ 06.12.2016 15:59:52 Конец правки. 
	
	// Макет = ПолучитьМакет(Объект.ОсновнойВариант.ПутьКМакету);.
	Макет = ПолучитьМакет(ПутьКМакету);
	
	Если Макет = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить макет по основному варианту.");
		Возврат;
	КонецЕсли;
	
	ПолеТабличногоДокумента = Макет;
	
КонецПроцедуры

&НаСервере
Функция ПутьКМакетуНаСервере(ОсновнойВариант)
	
	Возврат ОсновнойВариант.ПутьКМакету;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьВнешнийМакет(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр                  = "Табличный документ(*.mxl)|*.mxl";
	ДиалогВыбораФайла.Расширение              = "mxl";
	ДиалогВыбораФайла.Заголовок               = "Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.ИндексФильтра           = 0;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
		
		// БИТ_ЖКХ 28.01.2015{{
		// ПолеТабличногоДокумента.Прочитать(ИмяФайла);.
		ПрочитатьНаСервере(ИмяФайла);
		// БИТ_ЖКХ 28.01.2015}}
		
	КонецЕсли;
	
КонецПроцедуры

// БИТ_ЖКХ 28.01.2015{{
&НаСервере
Процедура ПрочитатьНаСервере(ИмяФайла)
	
	ПолеТабличногоДокумента.Прочитать(ИмяФайла);
	
КонецПроцедуры
// БИТ_ЖКХ 28.01.2015}}

&НаКлиенте
Процедура ОбъединитьЯчейки(Команда)
	
	Если ПолеТабличногоДокумента.ВыделенныеОбласти.Количество() = 1
		И ТипЗнч(ПолеТабличногоДокумента.ВыделенныеОбласти[0]) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		ТекущаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
		ОбъединитьОбласть(ТекущаяОбласть.Имя);
		
	Иначе
		
		ОчиститьСообщения();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Некорректная область!'");
		Сообщение.Поле = "ПолеТабличногоДокумента";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазъединитьЯчейки(Команда)
	
	Если ПолеТабличногоДокумента.ВыделенныеОбласти.Количество() = 1
		И ТипЗнч(ПолеТабличногоДокумента.ВыделенныеОбласти[0]) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		ТекущаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
		РазъединитьОбласть(ТекущаяОбласть.Имя);
		
	Иначе
		
		ОчиститьСообщения();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Некорректная область!'");
		Сообщение.Поле = "ПолеТабличногоДокумента";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьМакет(Команда)
	
	ОчиститьСообщения();
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Укажите каталог'");
	ДиалогВыбораФайла.Каталог   = Каталог;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ИмяФайла = "Вариант счет-извещения(" + Объект.Наименование + ").mxl";
		Каталог  = ДиалогВыбораФайла.Каталог;
		
		ПолныйПустьКФайлу = ДиалогВыбораФайла.Каталог + "\" + ИмяФайла;
		
		Попытка
			
			ПолеТабличногоДокумента.Записать(ПолныйПустьКФайлу, ТипФайлаТабличногоДокумента.MXL);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл : """ + ИмяФайла + """ сохранен в каталог: " + Каталог);
			
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойВариантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Предопределенный", Истина);
	
	ОткрытьФорму("Справочник.бит_ВариантыСчетовИзвещений.Форма.ФормаВыбора", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПользовательскуюФункциюПриИзменении(Элемент)
	
	УправлениеВидимостьюЭлементовФормы();
	
	Если Объект.ИспользоватьПользовательскуюФункцию Тогда
		Объект.ОсновнойВариант = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляДоступныеПоля

&НаКлиенте
Процедура ДоступныеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ДоступныеПоля.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ВыборДоступногоПоля(ТекущаяСтрока)
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьМакет(ПутьКМакету)
	
	Попытка
		Макет = Обработки.бит_ПечатьСчетИзвещений.ПолучитьМакет(ПутьКМакету);
	Исключение
		Макет = Неопределено;
	КонецПопытки;
	
	Возврат Макет;
	
КонецФункции // ()

&НаСервере
Процедура ОбъединитьОбласть(ИмяОбласти)
	
	Область = ПолеТабличногоДокумента.Область(ИмяОбласти);
	Область.Объединить();
	
КонецПроцедуры

&НаСервере
Процедура РазъединитьОбласть(ИмяОбласти)
	
	Область = ПолеТабличногоДокумента.Область(ИмяОбласти);
	Область.Разъединить();
	
КонецПроцедуры

&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОбновитьДеревоПолей()
	
	ОбработкаОбъект     = Обработки.бит_ПечатьСчетИзвещений.Создать();
	
	СтруктураДанных     = ОбработкаОбъект.ПолучитьСтруктуруДанных();
	ТаблицаПечати       = ОбработкаОбъект.ПолучитьТаблицуПечати();
	ТаблицаСчетчиков    = ОбработкаОбъект.ПолучитьТаблицуПечатиСчетчиков();
	ТаблицаПерерасчетов = ОбработкаОбъект.ПолучитьТаблицуПерерасчетов();
	
	// БИТ_ЖКХ 26.09.2014
	ТаблицаСвойств = Новый ТаблицаЗначений;
	ТаблицаСвойств.Колонки.Добавить("Свойство"     , Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов"));
	
	// ТаблицаСвойств.Колонки.Добавить("Свойство",Тип("СправочникСсылка.ЗначенияСвойствОбъектов"));.
	ТаблицаСвойств.Колонки.Добавить("Значение",Неопределено);
	// ТаблицаПерерасчетов.Колонки.Добавить("Комментарий", ОбщегоНазначения.ОписаниеТипаСтрока(999));.
	// БИТ_ЖКХ 26.09.2014
	
	ТаблицаОбщедомовыхСчетчиков    = ОбработкаОбъект.ПолучитьТаблицуОбщедомовыхСчетчиков();
	
	Корень = ДоступныеПоля.ПолучитьЭлементы();
	Корень.Очистить();
	
	ПолеДанных = Корень.Добавить();
	ПолеДанных.Поле = "Реквизиты";
	ПоляСтруктурыДанных = ПолеДанных.ПолучитьЭлементы();
	
	СтруктураДанных = СортировкаСтруктуры (СтруктураДанных);
	Для каждого КлючЗначение Из СтруктураДанных Цикл
		
		НовоеПоле      = ПоляСтруктурыДанных.Добавить();
		НовоеПоле.Поле = КлючЗначение.Ключ;
		
	КонецЦикла;
	
	ПолеТаблицыПечати = Корень.Добавить();
	ПолеТаблицыПечати.Поле = "Строка: Таблица начислений";
	ПоляТаблицыПечати      = ПолеТаблицыПечати.ПолучитьЭлементы();
	
	Для каждого Колонка Из ТаблицаПечати.Колонки Цикл
		
		НовоеПоле      = ПоляТаблицыПечати.Добавить();
		НовоеПоле.Поле = Колонка.Имя;
		
	КонецЦикла;
	
	ПолеТаблицыСчетчиков = Корень.Добавить();
	ПолеТаблицыСчетчиков.Поле = "Строка: Таблица счетчиков";
	ПоляТаблицыСчетчиков  = ПолеТаблицыСчетчиков.ПолучитьЭлементы();
	
	Для каждого Колонка Из ТаблицаСчетчиков.Колонки Цикл
		
		НовоеПоле      = ПоляТаблицыСчетчиков.Добавить();
		НовоеПоле.Поле = Колонка.Имя;
		
	КонецЦикла;
	
	ПолеТаблицыПерерасчетов = Корень.Добавить();
	ПолеТаблицыПерерасчетов.Поле = "Строка: Таблица перерасчетов";
	ПоляТаблицыПерерасчетов  = ПолеТаблицыПерерасчетов.ПолучитьЭлементы();
	
	Для каждого Колонка Из ТаблицаПерерасчетов.Колонки Цикл
		
		НовоеПоле      = ПоляТаблицыПерерасчетов.Добавить();
		НовоеПоле.Поле = Колонка.Имя;
		
	КонецЦикла;
	
	// БИТ_ЖКХ 26.09.2014
	ПолеТаблицыСвойств = Корень.Добавить();
	ПолеТаблицыСвойств.Поле = "Строка: Таблица дополнительных свойств ЛС";
	ПолеТаблицыСвойств  = ПолеТаблицыСвойств.ПолучитьЭлементы();
	
	Для каждого Колонка Из ТаблицаСвойств.Колонки Цикл
		
		НовоеПоле      = ПолеТаблицыСвойств.Добавить();
		НовоеПоле.Поле = Колонка.Имя;
		
	КонецЦикла;
	// БИТ_ЖКХ 26.09.2014
	
	// БИТ_ЖКХ 03.02.2015{{
	ПолеТаблицыОбщедомовыхСчетчиков = Корень.Добавить();
	ПолеТаблицыОбщедомовыхСчетчиков.Поле = "Строка: Таблица общедомовых счетчиков";
	ПолеТаблицыОбщедомовыхСчетчиков  = ПолеТаблицыОбщедомовыхСчетчиков.ПолучитьЭлементы();
	
	Для каждого Колонка Из ТаблицаОбщедомовыхСчетчиков.Колонки Цикл
		
		НовоеПоле      = ПолеТаблицыОбщедомовыхСчетчиков.Добавить();
		НовоеПоле.Поле = Колонка.Имя;
		
	КонецЦикла;
	// БИТ_ЖКХ 03.02.2015}}
	
КонецПроцедуры // ()

&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура УправлениеВидимостьюЭлементовФормы()
	
	Элементы.ОсновнойВариант.Доступность = НЕ Объект.ИспользоватьПользовательскуюФункцию;
	Элементы.СтраницаПользовательскаяФункция.Видимость = Объект.ИспользоватьПользовательскуюФункцию;
	
КонецПроцедуры // () 

&НаКлиенте
Процедура ВыполнитьПроверкуАльгоритма(Команда)
	
	Если Параметры.Ключ.Пустая() ИЛИ Модифицированность Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед проверкой, запишите элемент.");
		
		Возврат;
		
	КонецЕсли; 
	
	Форма = ПолучитьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая");
	ЛицевойСчет = Форма.ОткрытьМодально();
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		
		Результат = СформироватьМакетПоЛС(ЛицевойСчет, Параметры.Ключ);
		
		Если НЕ Результат = Неопределено Тогда
			Результат.Показать("Результат проверки алгоритма печати варианта счет-извещения """ + Объект.Наименование +""".",,Истина);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезконтекста
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция СформироватьМакетПоЛС(ЛицевойСчет, МакетКв)
	
	Результат = Неопределено;
	
	ОбработкаОбъект = Обработки.бит_ПечатьСчетИзвещений.Создать();
	
	ОбработкаОбъект.МакетКв               = МакетКв;
	ОбработкаОбъект.Период                = ДобавитьМесяц(КонецМесяца(ТекущаяДата()), -1);
	ОбработкаОбъект.ШаблонИзвещений       = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	ОбработкаОбъект.Организация           = ЛицевойСчет.Организация;
	ОбработкаОбъект.РС                    = ЛицевойСчет.Организация.ОсновнойБанковскийСчет;
	ОбработкаОбъект.ТекущийПакет          = 1;
	ОбработкаОбъект.РазмерПакетаПечати    = 500;
	ОбработкаОбъект.РазмерПакетаПросмотра = 50;
	
	НоваяСтрока = ОбработкаОбъект.СписокЛС.Добавить();
	НоваяСтрока.ЛицевойСчет = ЛицевойСчет;
	
	ТаблицаДанных = ОбработкаОбъект.СформироватьДанныеПечати();
	
	Результат = ОбработкаОбъект.ПечатьКвитанций(ТаблицаДанных);
	
	Возврат Результат;
	
КонецФункции // ()

&НаСервереБезконтекста
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура СоздатьНастройкиМакета(ТекущийОбъект)
	
	Настройки = ПолучитьНостройкуМакета(ТекущийОбъект.ОсновнойВариант);
	
	НовыеНастройки = Справочники.бит_НастройкиПечатиМакетовСчетИзвещений.СоздатьЭлемент();
	
	Если ТипЗнч(Настройки) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(НовыеНастройки, Настройки);
	Иначе
		СвойстваИскл = "Родитель,Владелец,Код,Наименование";
		ЗаполнитьЗначенияСвойств(НовыеНастройки, Настройки,,СвойстваИскл);
	КонецЕсли; 
	
	НовыеНастройки.УстановитьНовыйКод();
	НовыеНастройки.Наименование   = "Настройки: " + ТекущийОбъект.Наименование;
	НовыеНастройки.МакетКвитанции = ТекущийОбъект.Ссылка;
	
	// БИТ_ЖКХ 12.08.2014	
	Если НЕ ТекущийОбъект.Предопределенный Тогда
		НовыеНастройки.ИмяПредопределенныхДанных = "";
	КонецЕсли;
	// БИТ_ЖКХ 12.08.2014
	
	НовыеНастройки.Записать();
	
	НоваяЗапись = РегистрыСведений.бит_ТекущиеНастройкиМакетовСчетИзвещений.СоздатьМенеджерЗаписи();
	НоваяЗапись.МакетКвитанции  = ТекущийОбъект.Ссылка;
	
	// БИТ_ЖКХ 07.02.2014
	// НоваяЗапись.Пользователь    = глЗначениеПеременной("глТекущийПользователь");.
	НоваяЗапись.Пользователь    = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	// БИТ_ЖКХ 07.02.2014
	
	НоваяЗапись.НастройкаМакета = НовыеНастройки.Ссылка;
	
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры // ()  

&НаСервереБезконтекста
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьНостройкуМакета(ОсновнойВариант)
	
	Настройка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкиПечатиМакетовСчетИзвещений.Ссылка
	|ИЗ
	|	Справочник.бит_НастройкиПечатиМакетовСчетИзвещений КАК бит_НастройкиПечатиМакетовСчетИзвещений
	|ГДЕ
	|	бит_НастройкиПечатиМакетовСчетИзвещений.МакетКвитанции = &МакетКвитанции
	|	И бит_НастройкиПечатиМакетовСчетИзвещений.Предопределенный";
	Запрос.УстановитьПараметр("МакетКвитанции", ОсновнойВариант);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Настройка = Выборка.Ссылка;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Настройка) Тогда
		
		Обработка = Обработки.бит_ПечатьСчетИзвещений.Создать();
		Настройка = Обработка.ПолучитьСтандартныеНастройкуМакета(ОсновнойВариант);
		
	КонецЕсли; 
	
	Возврат Настройка;
	
КонецФункции // ()

&НаСервере
Функция СортировкаСтруктуры(ОтчетСтруктура)
            //сортировка структуры
        ТЗ = Новый ТаблицаЗначений;
        ТЗ.Колонки.Добавить("Ключ");
        ТЗ.Колонки.Добавить("Значение");
        Для каждого элемент из ОтчетСтруктура Цикл
            новСтрока = ТЗ.Добавить();
            новСтрока.Ключ = Элемент.Ключ;
            новСтрока.Значение = Элемент.Значение;
        КонецЦикла;
        ТЗ.Сортировать("Ключ Возр");
        ОтчетСтруктура.Очистить();
        Для каждого строкаТЗ из ТЗ Цикл
            ОтчетСтруктура.Вставить(строкаТЗ.Ключ,строкаТЗ.Значение);
        КонецЦикла;     
        //
 
Возврат ОтчетСтруктура;
КонецФункции

#КонецОбласти
